In [76]:
import sqlalchemy as db
import pandas as pd
#Connect to db username:password@host/db_name
engine = db.create_engine('postgresql://DS4ATEAM32:DS4ATEAM32@ds4ateam32.cl8xbcsviig5.us-west-2.rds.amazonaws.com/DS4ATEAM32')

In [77]:
#Query to be performed
query = '''SELECT * FROM prueba'''

In [78]:
#Save query result object
query_result_obj = engine.execute(query)

In [79]:
#Save object values
result = query_result_obj.fetchall()

In [82]:
#Save query vaules as a pandas Dataframe
df = pd.DataFrame(result, columns = ['Name','Id'])

In [83]:
#Print df
df

     Name  Id
0  Daniel   0
1  Carlos   1